# DataSpark : Illuminating Insights for Global Electronics

In [79]:
import pandas as pd

from datetime import datetime

In [82]:
#importing CSV's into Dataframe


customers = pd.read_csv(r"C:\Users\haris\OneDrive\Documents\Project 2 - Data Spark\Customers.csv", encoding='ISO-8859-1')
sales = pd.read_csv(r"C:\Users\haris\OneDrive\Documents\Project 2 - Data Spark\Sales.csv",encoding='ISO-8859-1')
products = pd.read_csv(r"C:\Users\haris\OneDrive\Documents\Project 2 - Data Spark\Products.csv",encoding='ISO-8859-1')
stores = pd.read_csv(r"C:\Users\haris\OneDrive\Documents\Project 2 - Data Spark\Stores.csv",encoding='ISO-8859-1')
exchange_rates = pd.read_csv(r"C:\Users\haris\OneDrive\Documents\Project 2 - Data Spark\Exchange_Rates.csv",encoding='ISO-8859-1')

In [83]:
customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,07-03-1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [84]:
customers.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [85]:
customers.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [86]:
# Replace '/' with '-' in the 'Date' column

customers["Birthday"] = customers["Birthday"].str.replace('/', '-', regex=False)

In [87]:
customers

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,07-03-1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9-27-1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5-26-1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9-17-1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11-19-1965
...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Duková,Houston,TX,Texas,77017,United States,North America,3-25-1936
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,2-16-1992
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,11-09-1937
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,10-12-1937
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,8-18-1965

In [88]:
#Converting Datatype

customers["Birthday"]=pd.to_datetime(customers["Birthday"],format='%m-%d-%Y',errors='coerce')

customers.dtypes

CustomerKey             int64
Gender                 object
Name                   object
City                   object
State Code             object
State                  object
Zip Code               object
Country                object
Continent              object
Birthday       datetime64[ns]
dtype: object

In [89]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.2+ MB

In [90]:
# Fill null values in 'State Code' with a specific value

customers['State Code'].fillna('Unknown', inplace= True)

C:\Users\haris\AppData\Local\Temp\ipykernel_16264\2063327794.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customers['State Code'].fillna('Unknown', inplace= True)

In [91]:
#Converting cleaned customers data into CSV File

customers.to_csv("Customers.csv",index=False)

#Sales Dataset

In [92]:
sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,01-01-2016,NaN,265598,10,1304,1,CAD
1,366001,1,01-01-2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,01-01-2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,01-01-2016,01-12-2016,266019,0,1106,7,CAD
4,366002,2,01-01-2016,01-12-2016,266019,0,373,1,CAD

In [93]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [94]:
sales.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [95]:
# Replace '/' with '-' in the Delivery and order date column

sales["Delivery Date"] = sales["Delivery Date"].str.replace('/', '-', regex=False)

sales["Order Date"] = sales["Order Date"].str.replace('/', '-', regex=False)

In [96]:
#converting datatypes

sales["Delivery Date"]=pd.to_datetime(sales["Delivery Date"],format='%m-%d-%Y', errors='coerce')

sales["Order Date"]=pd.to_datetime(sales["Order Date"],format='%m-%d-%Y', errors='coerce')

In [97]:
sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD

In [98]:
# Backward fill missing values

sales['Delivery Date'] = sales['Delivery Date'].fillna(method='bfill')

C:\Users\haris\AppData\Local\Temp\ipykernel_16264\86328451.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  sales['Delivery Date'] = sales['Delivery Date'].fillna(method='bfill')

In [99]:
sales.isnull().sum()

Order Number     0
Line Item        0
Order Date       0
Delivery Date    0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [100]:
sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,2016-01-13,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD

In [101]:
#Converting cleaned sales data into CSV File

sales.to_csv("Sales.csv",index=True)

#Product details

In [102]:
products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [103]:
products.dtypes

ProductKey         int64
Product Name      object
Brand             object
Color             object
Unit Cost USD     object
Unit Price USD    object
SubcategoryKey     int64
Subcategory       object
CategoryKey        int64
Category          object
dtype: object

In [104]:
products.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [105]:
# Remove the $ symbol in 'Unit Cost USD' and 'Unit Price USD'] then convert to float

products['Unit Cost USD'] = products['Unit Cost USD'].replace('[\$,]', '', regex=True).astype(float)
products['Unit Price USD'] = products['Unit Price USD'].replace('[\$,]', '', regex=True).astype(float)

<>:3: SyntaxWarning: invalid escape sequence '\$'
<>:4: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\$'
<>:4: SyntaxWarning: invalid escape sequence '\$'
C:\Users\haris\AppData\Local\Temp\ipykernel_16264\4059013426.py:3: SyntaxWarning: invalid escape sequence '\$'
  products['Unit Cost USD'] = products['Unit Cost USD'].replace('[\$,]', '', regex=True).astype(float)
C:\Users\haris\AppData\Local\Temp\ipykernel_16264\4059013426.py:4: SyntaxWarning: invalid escape sequence '\$'
  products['Unit Price USD'] = products['Unit Price USD'].replace('[\$,]', '', regex=True).astype(float)

In [106]:
products.dtypes

ProductKey          int64
Product Name       object
Brand              object
Color              object
Unit Cost USD     float64
Unit Price USD    float64
SubcategoryKey      int64
Subcategory        object
CategoryKey         int64
Category           object
dtype: object

In [107]:
products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [108]:
#Converting cleaned Product data into CSV File

products.to_csv("Products.csv",index=True)

#Stores Dataset

In [109]:
stores.head()

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,01-01-2008
1,2,Australia,Northern Territory,665.0,01-12-2008
2,3,Australia,South Australia,2000.0,01-07-2012
3,4,Australia,Tasmania,2000.0,01-01-2010
4,5,Australia,Victoria,2000.0,12-09-2015

In [110]:
stores.dtypes

StoreKey           int64
Country           object
State             object
Square Meters    float64
Open Date         object
dtype: object

In [111]:
stores.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [112]:
# Replace '/' with '-' in 'Open Date' column

stores["Open Date"] = stores["Open Date"].str.replace('/', '-', regex=False)

In [113]:
# Convert 'Open Date' to datetime

stores['Open Date'] = pd.to_datetime(stores['Open Date'], format='%m-%d-%Y' ,errors= 'coerce')

In [114]:
# Null values filled with the mean of the column

stores['Square Meters'] = stores['Square Meters'].fillna(stores['Square Meters'].mean())

In [115]:
#Converting cleaned stores data into CSV File

stores.to_csv("Stores.csv",index=True)

#Exchance Rate

In [116]:
exchange_rates.head()

         Date Currency  Exchange
0  01-01-2015      USD    1.0000
1  01-01-2015      CAD    1.1583
2  01-01-2015      AUD    1.2214
3  01-01-2015      EUR    0.8237
4  01-01-2015      GBP    0.6415

In [117]:
exchange_rates.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [118]:
exchange_rates.dtypes

Date         object
Currency     object
Exchange    float64
dtype: object

In [120]:
# Replace '/' with '-' in the Date column

exchange_rates['Date']= exchange_rates['Date'].str.replace('/', '-', regex=False)

In [121]:
# Convert 'Open Date' to datetime

exchange_rates['Date'] = pd.to_datetime(exchange_rates['Date'], format='%m-%d-%Y' ,errors= 'coerce')

In [122]:
#Converting cleaned exchange rate data into CSV File

exchange_rates.to_csv("Exchange_rates.csv",index=True)

Merging data

In [132]:
# Merge customers with sales

merged = pd.merge(sales, customers, on='CustomerKey', how='left')

In [133]:
#Merge the result with products

merged = pd.merge(merged, products, on='ProductKey', how='left')

In [134]:
# Merge the result with stores
merged = pd.merge(merged, stores, on=['StoreKey','Country','State'], how='left')

In [135]:
# Convert 'Order Date' and 'Date' columns to datetime
merged['Order Date'] = pd.to_datetime(merged['Order Date'])
exchange_rates['Date'] = pd.to_datetime(exchange_rates['Date'])

In [136]:
# Merge on 'Order Date' and 'Currency Code' with 'Date' and 'Currency'
merged = pd.merge(merged, exchange_rates, left_on=['Order Date', 'Currency Code'], right_on=['Date', 'Currency'], how='left')

# Drop the 'Date' column as it's no longer needed
merged = merged.drop(columns='Date')

# Print the final merged DataFrame
print(merged)

       Order Number  Line Item Order Date Delivery Date  CustomerKey  \
0            366000          1 2016-01-01    2016-01-13       265598
1            366001          1 2016-01-01    2016-01-13      1269051
2            366001          2 2016-01-01    2016-01-13      1269051
3            366002          1 2016-01-01    2016-01-12       266019
4            366002          2 2016-01-01    2016-01-12       266019
...             ...        ...        ...           ...          ...
62879       2243030          1 2021-02-20    2021-02-24      1216913
62880       2243031          1 2021-02-20    2021-02-24       511229
62881       2243032          1 2021-02-20    2021-02-23       331277
62882       2243032          2 2021-02-20    2021-02-23       331277
62883       2243032          3 2021-02-20    2021-02-23       331277

       StoreKey  ProductKey  Quantity Currency Code  Gender  ...  \
0            10        1304         1           CAD    Male  ...
1             0        1048         2           USD    Male  ...
2             0        2007         1           USD    Male  ...
3             0        1106         7           CAD  Female  ...
4             0         373         1           CAD  Female  ...
...         ...         ...       ...           ...     ...  ...
62879        43         632         3           USD    Male  ...
62880         0          98         4           EUR  Female  ...
62881         0        1613         2           CAD    Male  ...
62882         0        1717         2           CAD    Male  ...
62883         0         464         7           CAD    Male  ...

      Unit Cost USD Unit Price USD SubcategoryKey  \
0             31.27          68.00            406
1            141.47         427.00            402
2            220.64         665.94            803
3            148.08         322.00            402
4            166.20         326.00            301
...             ...            ...            ...
62879         70.87         139.00            305
62880         55.18         120.00            106
62881         56.08         109.99            602
62882         32.25          70.13            702
62883        224.97         679.00            304

                            Subcategory CategoryKey  \
0      Cameras & Camcorders Accessories           4
1                   Digital SLR Cameras           4
2                            Microwaves           8
3                   Digital SLR Cameras           4
4                               Laptops           3
...                                 ...         ...
62879              Projectors & Screens           3
62880              Bluetooth Headphones           1
62881                         Movie DVD           6
62882                    Download Games           7
62883                          Monitors           3

                            Category Square Meters Open Date Currency Exchange
0             Cameras and camcorders           NaN       NaT      CAD   1.3884
1             Cameras and camcorders           NaN       NaT      USD   1.0000
2                    Home Appliances           NaN       NaT      USD   1.0000
3             Cameras and camcorders           NaN       NaT      CAD   1.3884
4                          Computers           NaN       NaT      CAD   1.3884
...                              ...           ...       ...      ...      ...
62879                      Computers           NaN       NaT      USD   1.0000
62880                          Audio           NaN       NaT      EUR   0.8238
62881  Music, Movies and Audio Books           NaN       NaT      CAD   1.2610
62882                 Games and Toys           NaN       NaT      CAD   1.2610
62883                      Computers           NaN       NaT      CAD   1.2610

[62884 rows x 31 columns]

In [137]:
# Null values filled with the mean of the column

merged['Square Meters'] = merged['Square Meters'].fillna(stores['Square Meters'].mean())

In [138]:
# Backward fill missing dates without inplace

merged['Open Date'] = merged['Open Date'].fillna(method='bfill')

C:\Users\haris\AppData\Local\Temp\ipykernel_16264\3863822749.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  merged['Open Date'] = merged['Open Date'].fillna(method='bfill')

In [139]:
merged['Open Date'] = merged['Open Date'].fillna(method='bfill').fillna(method='ffill')

C:\Users\haris\AppData\Local\Temp\ipykernel_16264\2919580275.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  merged['Open Date'] = merged['Open Date'].fillna(method='bfill').fillna(method='ffill')

In [141]:
#into CSV

merged.to_csv("Dataspark.csv", index = False)

In [142]:
merged.isnull().sum()

Order Number      0
Line Item         0
Order Date        0
Delivery Date     0
CustomerKey       0
StoreKey          0
ProductKey        0
Quantity          0
Currency Code     0
Gender            0
Name              0
City              0
State Code        0
State             0
Zip Code          0
Country           0
Continent         0
Birthday          0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
Square Meters     0
Open Date         0
Currency          0
Exchange          0
dtype: int64

In [143]:
merged.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Gender,...,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,Square Meters,Open Date,Currency,Exchange
0,366000,1,2016-01-01,2016-01-13,265598,10,1304,1,CAD,Male,...,31.27,68.00,406,Cameras & Camcorders Accessories,4,Cameras and camcorders,1402.19697,2015-12-09,CAD,1.3884
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD,Male,...,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,1402.19697,2015-12-09,USD,1.0000
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD,Male,...,220.64,665.94,803,Microwaves,8,Home Appliances,1402.19697,2015-12-09,USD,1.0000
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD,Female,...,148.08,322.00,402,Digital SLR Cameras,4,Cameras and camcorders,1402.19697,2015-12-09,CAD,1.3884
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD,Female,...,166.20,326.00,301,Laptops,3,Computers,1402.19697,2015-12-09,CAD,1.3884

In [144]:
merged.dtypes

Order Number               int64
Line Item                  int64
Order Date        datetime64[ns]
Delivery Date     datetime64[ns]
CustomerKey                int64
StoreKey                   int64
ProductKey                 int64
Quantity                   int64
Currency Code             object
Gender                    object
Name                      object
City                      object
State Code                object
State                     object
Zip Code                  object
Country                   object
Continent                 object
Birthday          datetime64[ns]
Product Name              object
Brand                     object
Color                     object
Unit Cost USD            float64
Unit Price USD           float64
SubcategoryKey             int64
Subcategory               object
CategoryKey                int64
Category                  object
Square Meters            float64
Open Date         datetime64[ns]
Currency                  object
Exchange                 float64
dtype: object

In [146]:


# Ensure the Birthday column is in datetime format
merged['Birthday'] = pd.to_datetime(merged['Birthday'], errors='coerce')

# Calculate Age based on the Birthday column
current_year = datetime.now().year
merged['Age'] = current_year - merged['Birthday'].dt.year

# Calculate Profit Margin: (Unit Price USD - Unit Cost USD) / Unit Price USD
merged['Profit_Margin'] = (merged['Unit Price USD'] - merged['Unit Cost USD']) / merged['Unit Price USD']

# Calculate Revenue: Quantity * Unit Price USD
merged['Revenue'] = merged['Quantity'] * merged['Unit Price USD']

# Display the updated DataFrame with the new columns
print(merged[['Age', 'Profit_Margin', 'Revenue']].head())

   Age  Profit_Margin  Revenue
0   53       0.540147    68.00
1   29       0.668689   854.00
2   29       0.668679   665.94
3   62       0.540124  2254.00
4   62       0.490184   326.00

In [147]:
#into CSV

merged.to_csv("Dataspark.csv", index = False)

In [148]:
merged.columns

Index(['Order Number', 'Line Item', 'Order Date', 'Delivery Date',
       'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency Code',
       'Gender', 'Name', 'City', 'State Code', 'State', 'Zip Code', 'Country',
       'Continent', 'Birthday', 'Product Name', 'Brand', 'Color',
       'Unit Cost USD', 'Unit Price USD', 'SubcategoryKey', 'Subcategory',
       'CategoryKey', 'Category', 'Square Meters', 'Open Date', 'Currency',
       'Exchange', 'Age', 'Profit_Margin', 'Revenue'],
      dtype='object')